Catalogs/ПричиныОбращений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ПричиныОбращений</Name>
			<Comment>Причины обращений</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПричинаОбращения</Name>
					<Comment>Полное описание причины обращения клиента</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Comment>Код причины обращения по классификатору</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Артикул</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПричиныОбращения</Name>
					<Comment>Тип причины обращения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыПричинОбращения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРемонта</Name>
					<Comment>Вид ремонта причины обращения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРемонта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретитьВыбор</Name>
					<Comment>Запретить выбор</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяВыполнения</Name>
					<Comment>Время выполнения</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипАвторабот</Name>
					<Comment>Тип авторабот</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыАвторабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НормыВремени</Name>
					<Comment>Нормы времени выполнения по причине обращения</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Модель</Name>
							<Comment>Модель</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Модели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантКомплектации</Name>
							<Comment>Вариант комплектации автомобиля</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ВариантыКомплектации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяВыполнения</Name>
							<Comment>Время выполнения</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/РежимыКонтроляУникальностиНомераПоКаталогу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>РежимыКонтроляУникальностиНомераПоКаталогу</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеКонтролировать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоВсейНоменклатуре</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоПроизводителю</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ПричиныОбращений/Ext/ManagerModule.bsl
// Модуль менеджера справочника "Причины обращений"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда    
	
#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВерсионированиеОбъектов
// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
// 	 Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
КонецПроцедуры

#КонецОбласти 

#Область ОбновлениеИБ

// Выполняет заполнение реквизита Тип авторабот значением по умолчанию.
//
Процедура ЗаполнитьТипАвтоработПоУмолчанию() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПричиныОбращений.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ПричиныОбращений КАК ПричиныОбращений
	|ГДЕ
	|	ПричиныОбращений.ТипАвторабот = ЗНАЧЕНИЕ(Справочник.ТипыАвторабот.ПустаяСсылка)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СправочникОбъект.ОбменДанными.Загрузка = Истина;
		СправочникОбъект.ТипАвторабот = Справочники.ТипыАвторабот.ПоУмолчанию;
		
		Попытка
			
			СправочникОбъект.Записать();
			
		Исключение
			
			ТекстОшибки = НСтр("ru = 'Не удалось обновить: '")
				+ Символы.ПС
				+ ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ЗаписьЖурналаРегистрации(
				"Причины обращений.Заполнение типа авторабот",
				УровеньЖурналаРегистрации.Ошибка,
				,
				Выборка.Ссылка,
				ТекстОшибки
			);
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Источник = ПолучитьЗначениеПараметраСтруктуры(Параметры, "Источник", "");
	
	Если Источник = "ЗаявкаНаРемонт_ПричинаОбращения" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПричиныОбращений.Ссылка
		|ИЗ
		|	Справочник.ПричиныОбращений КАК ПричиныОбращений
		|ГДЕ
		|	(ПричиныОбращений.Наименование ПОДОБНО &Наименование СПЕЦСИМВОЛ ""~""
		|			ИЛИ ПричиныОбращений.ПричинаОбращения ПОДОБНО &ПричинаОбращения СПЕЦСИМВОЛ ""~"")
		|	И ПричиныОбращений.ЗапретитьВыбор = ЛОЖЬ";
		
		СтрокаПоиска = ОбщегоНазначения.СформироватьСтрокуДляПоискаВЗапросе(Параметры.СтрокаПоиска);
		Запрос.УстановитьПараметр("Наименование"     , СтрокаПоиска + "%");
		Запрос.УстановитьПараметр("ПричинаОбращения" , "%" + СтрокаПоиска + "%");
		
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Формирование причины обращения в виде строки
//
// Параметры
//  СтараяПричинаОбращения  - <Строка> - Старая причина обращения
//                 <продолжение описания параметра>
//  НоваяПричинаОбращения  - <ПричиныОбращений.Ссылка>,<Массив> - Новая причина обращения.
//
// Возвращаемое значение:
//   <Строка>   - Новая причина обращения.
//
Функция СформироватьПричинуОбращения(НоваяПричинаОбращения, СтараяПричинаОбращения = "") Экспорт
	Если ТипЗнч(НоваяПричинаОбращения) = Тип("СправочникСсылка.ПричиныОбращений") Тогда
		МассивПричинОбращения = Новый Массив;
		МассивПричинОбращения.Добавить(НоваяПричинаОбращения);
	ИначеЕсли ТипЗнч(НоваяПричинаОбращения) = Тип("Массив") И НоваяПричинаОбращения.Количество() > 0 Тогда
		МассивПричинОбращения = НоваяПричинаОбращения;
	Иначе
		Возврат СтараяПричинаОбращения;
	КонецЕсли;
	
	НоваяПричинаОбращения = СокрЛП(СтараяПричинаОбращения);
	Для Каждого ПричинаОбращения Из МассивПричинОбращения Цикл
		ПричинаОбращенияАртикул          = СокрЛП(ПричинаОбращения.Артикул);
		ПричинаОбращенияПричинаОбращения = СокрЛП(ПричинаОбращения.ПричинаОбращения);
		
		Если НЕ ПустаяСтрока(НоваяПричинаОбращения) Тогда
			НоваяПричинаОбращения = НоваяПричинаОбращения + Символы.ВК;
		КонецЕсли;
		
		Если НЕ ПустаяСтрока(ПричинаОбращенияАртикул) Тогда
			НоваяПричинаОбращения = НоваяПричинаОбращения + "[" + ПричинаОбращенияАртикул + "] ";
		КонецЕсли;
		
		НоваяПричинаОбращения = НоваяПричинаОбращения + ПричинаОбращенияПричинаОбращения;
	КонецЦикла;
	
	Возврат НоваяПричинаОбращения;
КонецФункции // СформироватьПричинуОбращения()

// Формирует массив причин обращения запрещенных к выбору в документах
//
Функция ПолучитьЗапрещенныеКВыборуПричины() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПричиныОбращений.Ссылка
	|ИЗ
	|	Справочник.ПричиныОбращений КАК ПричиныОбращений
	|ГДЕ
	|	ПричиныОбращений.ЗапретитьВыбор = ИСТИНА";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

#Область ПараметрыОбработкиРеквизитовОбъекта

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты объекта
	ОбязательныеРеквизиты = Новый Массив();
	ОбязательныеРеквизиты.Добавить("Наименование");
	
	// Обработаем в зависимости от вида элемента
	Если НЕ Объект.ЭтоГруппа Тогда
		ОбязательныеРеквизиты.Добавить("ПричинаОбращения");
		Если Автосервис.АртикулОбязательный() Тогда
			ОбязательныеРеквизиты.Добавить("Артикул");
		КонецЕсли;
	КонецЕсли;
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности и уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов и вариант проверки его заполнения
//  (1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный). Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Структура уникальных реквизитов
	УникальныеРеквизиты = Новый Структура();
	УникальныеРеквизиты.Вставить("Код");
	
	Если НЕ Объект.ЭтоГруппа Тогда
		РежимКонтроля = Автосервис.РежимКонтроляУникальностиАртикула();
		Если РежимКонтроля <> Перечисления.РежимыКонтроляУникальностиНомераПоКаталогу.НеКонтролировать Тогда
			УникальныеРеквизиты.Вставить("Артикул");
		КонецЕсли;
	КонецЕсли;
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Обработчик события возникающего при изменении данных реквизита "Наименование".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура НаименованиеПриИзменении(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	Если ПустаяСтрока(СокрЛП(Объект.ПричинаОбращения)) Тогда
		Объект.ПричинаОбращения = Объект.Наименование;
	КонецЕсли;
	
КонецПроцедуры // НаименованиеПриИзменении()

#КонецОбласти

#КонецОбласти

#КонецЕсли
